Public Member Functions | Public Attributes | Protected Member Functions | List of all members
ACAPI::MEP::v1::ElementDefault Class Reference
MEP Element Manager
The ElementDefault contains the necessary non-geometric data for creating a MEP element. More...
#include <MEPElementDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::ElementDefault:
 Public Member Functions
std::optional< double >  | GetInsulationThickness () const
uint32_t  | GetPortCount () const
Result< ConnectorShape >  | GetShapeOfPort (uint32_t portIdx) const
Domain  | GetDomain () const
API_Guid  | GetObjectId () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
void  | RemoveInsulation ()
Removes the insulation.
Result< void >  | SetInsulationThickness (double insulationThickness)
Sets the thickness of insulation on the ElementDefault.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ElementDefault.
 Public Attributes
friend  | ElementDefault
 Protected Member Functions
ElementDefault (std::shared_ptr< Impl::IElementDefaultImpl > impl)
Modifier (ElementDefault &)
virtual  | ~Modifier ()
Detailed Description
The ElementDefault contains the necessary non-geometric data for creating a MEP element.
Since
Archicad 27
Example code snippets from Test / New MEP
Getters
 auto ductBranchDefault = CreateBranchDefault (Domain::Ventilation);
 if (ductBranchDefault.IsErr ())
 return ductBranchDefault.UnwrapErr ().kind;
 WriteElementDefaultDetails (*ductBranchDefault);
 auto pipeBranchDefault = CreateBranchDefault (Domain::Piping);
 if (pipeBranchDefault.IsErr ())
 return pipeBranchDefault.UnwrapErr ().kind;
 WriteElementDefaultDetails (*pipeBranchDefault);
 auto cableCarrierBranchDefault = CreateBranchDefault (Domain::CableCarrier);
 if (cableCarrierBranchDefault.IsErr ())
 return cableCarrierBranchDefault.UnwrapErr ().kind;
 WriteElementDefaultDetails (*cableCarrierBranchDefault);
void WriteElementDefaultDetails (const ElementDefault& mepElemDefault)
{
 Reporter elementDefaultReporter;
 elementDefaultReporter.Add ("Domain of default:", mepElemDefault.GetDomain ());
 elementDefaultReporter.SetTabCount (1);
 uint32_t portCount = mepElemDefault.GetPortCount ();
 for (uint32_t portIdx = 0; portIdx < portCount; portIdx++) {
 auto portShape = mepElemDefault.GetShapeOfPort (portIdx);
 if (!portShape.IsErr ())
 elementDefaultReporter.Add ("Shape of port", *portShape);
 }
 elementDefaultReporter.SetTabCount (0);
 std::optional<double> insulation = mepElemDefault.GetInsulationThickness ();
 insulation.has_value () ? elementDefaultReporter.Add ("Insulation thickness", *insulation) : elementDefaultReporter.Add ("Has no insulation");
 elementDefaultReporter.Write ();
}
Constructor & Destructor Documentation
◆ ElementDefault()
 ACAPI::MEP::v1::ElementDefault::ElementDefault  |  ( |  std::shared_ptr< Impl::IElementDefaultImpl >  |  impl | )
protected
◆ ~Modifier()
 virtual ACAPI::MEP::v1::ElementDefault::~Modifier  |  ( |   | )
protectedvirtual
Member Function Documentation
◆ GetDomain()
 Domain ACAPI::MEP::v1::ElementDefault::GetDomain  |  ( |   | ) |   const
Returns
Returns the domain of the ElementDefault.
◆ GetInsulationThickness()
 std::optional< double > ACAPI::MEP::v1::ElementDefault::GetInsulationThickness  |  ( |   | ) |   const
Returns
Returns the insulation thickness if the ElementDefault has insulation, otherwise std::nullopt. ElementDefaults of cable carrier domain cannot have insulation.
◆ GetObjectId()
 API_Guid ACAPI::MEP::v1::ElementDefault::GetObjectId  |  ( |   | ) |   const
Returns
Returns the main GUID of the referenced Library Part.
◆ GetPortCount()
 uint32_t ACAPI::MEP::v1::ElementDefault::GetPortCount  |  ( |   | ) |   const
Returns
Returns the number of ports.
◆ GetShapeOfPort()
 Result< ConnectorShape > ACAPI::MEP::v1::ElementDefault::GetShapeOfPort  |  ( |  uint32_t  |  portIdx | ) |   const
Parameters
portIdx | The zero based Index of the Port.
Returns
Returns error if index is out of range, otherwise returns the shape of the Port of the ElementDefault.
◆ Modifier()
 ACAPI::MEP::v1::ElementDefault::Modifier  |  ( |  ElementDefault &  |   | )
protected
◆ Modify()
 template<class ModifierFunc >
 Result< void > ACAPI::MEP::v1::ElementDefault::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ RemoveInsulation()
 void ACAPI::MEP::v1::ElementDefault::RemoveInsulation  |  ( |   | )
Removes the insulation.
◆ SetInsulationThickness()
 Result< void > ACAPI::MEP::v1::ElementDefault::SetInsulationThickness  |  ( |  double  |  insulationThickness | )
Sets the thickness of insulation on the ElementDefault.
Parameters
insulationThickness | The value to be set.
Returns
Returns an error if the Element is of cable carrier domain, otherwise nothing.
◆ SetObjectId()
 void ACAPI::MEP::v1::ElementDefault::SetObjectId  |  ( |  const API_Guid &  |  libraryPartId | )
Sets the referenced library part of the ElementDefault.
Parameters
libraryPartId | The main GUID of the library part.
Member Data Documentation
◆ ElementDefault
 friend ACAPI::MEP::v1::ElementDefault::ElementDefault